<?php

return [
    'user' => [
        'wrong_credentials' => 'Неверные параметры входа',
        'email_not_found' => 'Пользователь по указанному email не найден',
        'another_auth_trouble' => 'Возникла непредвиденная ошибка',
    ],
    'role' => [
        'not_exists' => 'Подходящая роль для текущего пользователя не найдена',
        'not_have' => 'У вас нет прав на выполнение данных действий',
        'perm_not_exists' => 'Отсутствует подходящее разрешение у роли',
    ],
    'order' => [
        'last_not_found' => 'Последний заказ не найден',
        'not_create' => 'Не удалось создать заказ',
    ],
    'api_price' => [
        'bad_request' => 'Не удалось получить доступ к API',
        'invalid_auth' => 'Не удалось авторизоваться',
        'el_code_not_exists' => 'Элемент c указанным кодом отсутствует',
    ],
    'promotion' => [
        'not_created' => 'Не удалось создать акцию',
    ],
];
